artillery_test.yml
config:
  target: 'https://pacific-crag-66541.herokuapp.com'
  phases:
    - duration: 6
      arrivalRate: 20
  defaults:
    # headers:
    #   x-my-service-auth: '987401838271002188298567'
scenarios:
  - flow:
    - get:
        url: "/gis/testpoint/?x=-299.53125&y=38.272688535980976/"
    - put:
        url: '/gis/addpolygon/'
        json:
          {'geometry': {'type': 'Polygon', 'coordinates': [[5, 6], [7, 8], [9, 10]]}}